const Blessing = [
  "生日快乐！愿你的生活充满幸福和成功，每一天都充满阳光和笑声",
  "愿你的梦想成真，未来的岁月充满喜悦和无尽的可能",
  "愿你的心中充满爱和温暖，每一天都带给你无尽的快乐和满足",
  "愿你的生活充满美丽的回忆和珍贵的时刻，每一天都是一个新的开始",
  "愿你的每一天都充满惊喜和成功，追逐梦想的道路上永远有坚定的步伐和幸运的陪伴",
];
export const emoji = [
  "😀",
  "😃",
  "😄",
  "😉",
  "🥰",
  "😘",
  "😗",
  "😋",
  "😛",
  "🤪",
  "😝",
  "🤑",
  "🤗",
  "🤭",
  "🤫",
  "🤔",
  "😺",
  "😸",
  "😹",
  "💌",
  "💘",
  "💝",
  "💖",
  "💗",
  "💓",
  "💞",
  "💞",
  "💟",
  "🧡",
  "💛",
  "💚",
  "💙",
  "🤎",
  "💋",
  "💯",
  "💢",
];

/**
 * @description:菜单名：和进入后显示的内容
 */
const obj = {
  生日祝福: Blessing,
  "emoji😀": emoji,
  视频: "video",
};

export const Menu = () => {
  return Object.keys(obj).map((key) => {
    return {
      type: "text",
      name: key,
      value: obj[key as keyof typeof obj],
    };
  });
};
